/*******************************************************************************
* 文件名称：LED闪烁实验
* 实验目的：1.掌握单片机IO口操作的基本方法
*           2.掌握软件延时函数的设计方法
* 实验配置：J3跳线配置为IO方式，J5配置为KBD、J2配置为1-3和2-4
* 实验现象：LED以0.2S为间隔亮灭
* 硬件环境：IAP15F2K61S2单片机，单片机内部振荡器频率：11.0592M
* 注意事项：包含STC15F2K60S2.H头文件，里面包含了所有的STC15系列的寄存器定义，
            此头文件可在STC-ISP软件中生成，要用到_nop_()必须要包含intrins.h
			头文件
* 日期版本：2022/2/8
*******************************************************************************/
#include "STC15F2K60S2.H"
#include "intrins.h"

//关闭蜂鸣器
void cls_buzz(void)
{
    P2 = (P2 & 0x1F | 0xA0);
    P0 = 0x00;
    P2 &= 0x1F;
}

//延时200ms
void delay()		//@11.0592MHz
{
    unsigned char i, j, k;

    _nop_();
    _nop_();
    i = 9;
    j = 104;
    k = 139;
    do
    {
        do
        {
            while (--k);
        }
        while (--j);
    }
    while (--i);
}


void main(void)
{
    cls_buzz();
    while(1)
    {
        P2 = ((P2 & 0x1f) | 0x80);
        P0 = 0xff;  //LED关
        P2 &= 0x1f;
        delay();

        P2 = ((P2 & 0x1f) | 0x80);
        P0 = 0x00;  //LED开
        P2 &= 0x1f;
        delay();
    }
}
