/*******************************************************************************
* 文件名称：外部中断实验
* 实验目的：1.掌握51单片机外部中断相关寄存器的配置方法和触发方式
*           2.掌握keil uVision 环境下外部中断服务函数的设计方法
* 实验配置：J3跳线配置为IO方式，J5配置为BTN、J2配置为1-3和2-4
* 实验现象：分别按S4、S5按键，对应的led1、led2亮灭显示
* 硬件环境：IAP15F2K61S2@11.0592MHz
* 程序说明：1.按下P3.2-INT0引脚对应的按键S5，LED1状态反转
*           2.按下P3.3-INT1引脚对应的按键S4, LED2状态反转(按键没有加防抖)
* 日期版本：2022/02/08
*******************************************************************************/

#include "reg52.h"  //定义51单片机特殊功能寄存器

sbit LED1 = P0 ^ 0;
sbit LED2 = P0 ^ 1;

void cls_buzz()
{
    P2 = ((P2 & 0x1f) | 0xA0);
    P0 = 0x00;
    P2 &= 0x1f;
}
void cls_led()
{
    P2 = ((P2 & 0x1f) | 0x80);
    P0 = 0xFF;
    P2 &= 0x1f;
}

void main(void)
{
    cls_buzz();
    cls_led();
    EX0 = 1;
    IT0 = 1;  //边沿触发方式(下降沿)
    EX1 = 1;
    IT1 = 1;  //边沿触发方式(下降沿)
    EA = 1;  //开启总中断
    while(1);
}

//外部中断0中断服务函数
void isr_intr_0(void) interrupt 0
{
    P2 = ((P2 & 0x1f) | 0x80);
    LED1 = ~LED1;
    P2 = P2 & 0x1f;
}

//外部中断1中断服务函数
void isr_intr_1(void) interrupt 2
{
    P2 = ((P2 & 0x1f) | 0x80);
    LED2 = ~LED2;
    P2 = P2 & 0x1f;
}

